_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_СформироватьЭкземплярБюджетаИнвестиционногоПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_СформироватьЭкземплярБюджетаИнвестиционногоПроекта</Name>
			<Comment>Сформировать экземпляр бюджета инвестиционного проекта</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокДоходовРасходов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_ГрафикДвиженийПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_ГрафикДвиженийПоДоговору</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФинансированиеПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФинансированиеФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокДоходовРасходовПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокДоходовРасходовФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетДавальцу</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ВзаимозачетЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытияПоДоговору</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
						<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СоответствиеОбъектовСтроительстваПроектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СоответствиеОбъектовСтроительстваПроектам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ДополнительныеПараметрыПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ДополнительныеПараметрыПоДоговору</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДоговорРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВариантыОплатыКлиентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыОплатыКлиентом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансДоОбеспечения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоплатаДоОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитПослеОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСОERP_ГарантийноеУдержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСдвиг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВариантыОплатыПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыОплатыПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансДоПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоплатаДоПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитПослеПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСОERP_ГарантийноеУдержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСдвиг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтатусыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыПланов</Name>
			<Comment>Статусы планов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_СформироватьЭкземплярБюджетаИнвестиционногоПроекта/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипБюджета = "БДДС";
	Элементы.ИсходныеДанныеПорядокОплаты.Видимость=Истина;
	Элементы.ИсходныеДанныеПорядокДоходовРасходов.Видимость=Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТипБюджетаПриИзменении(Элемент)
	
	Если ТипБюджета="БДДС" тогда
		Элементы.ИсходныеДанныеПорядокОплаты.Видимость=Истина;
		Элементы.ИсходныеДанныеПорядокДоходовРасходов.Видимость=Ложь;
	ИначеЕсли ТипБюджета="БДР" тогда
		Элементы.ИсходныеДанныеПорядокОплаты.Видимость=Ложь;
		Элементы.ИсходныеДанныеПорядокДоходовРасходов.Видимость=Истина;
	Иначе
		Элементы.ИсходныеДанныеПорядокОплаты.Видимость=Ложь;
		Элементы.ИсходныеДанныеПорядокДоходовРасходов.Видимость=Ложь;
	КонецЕсли;
	
	Объект.ИсходныеДанные.Очистить();
	Объект.ВидБюджета = ПредопределенноеЗначение("Справочник.ВидыБюджетов.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	ОбщегоНазначенияУТКлиент.РедактироватьПериод(
		Объект, 
		Новый Структура("ДатаНачала, ДатаОкончания", "НачалоПериода", "ОкончаниеПериода"));
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеТабличнойЧасти

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ПроверитьЗаполнение() тогда	
		Возврат;
	КонецЕсли;
	
	Если Объект.НачалоПериода>Объект.ОкончаниеПериода тогда 
		сообщить("Неправильно задан период: начало периода должно быть меньше или равно окончанию");
	КонецЕсли;	
	
	Если ТипБюджета="БДДС" тогда
		ПолучитьДанныеДвиженияДС()
	ИначеЕсли ТипБюджета="БДР" тогда
		ПолучитьДанныеДоходовРасходов()
	Иначе
		Сообщить("Не выбран тип бюджета");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеДвиженияДС()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Контрагент КАК Контрагент,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Договор КАК Договор,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.ВидРабот КАК ВидРабот,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Работа,
		|	СУММА(УСОERP_ГрафикДвиженийПоДоговоруОбороты.ФинансированиеПланПриход) КАК Сумма,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Период КАК Период,
		|	ВЫБОР
		|		КОГДА УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.АвансДоОбеспечения)
		|				ИЛИ УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки)
		|				ИЛИ УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.АвансДоПодтверждения)
		|				ИЛИ УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.ПредоплатаДоПоступления)
		|			ТОГДА УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.СтатьяБДДСАвансовогоПлатежа
		|		КОГДА УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
		|				ИЛИ УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.КредитПослеПоступления)
		|			ТОГДА УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.СтатьяБДДСОсновногоПлатежа
		|		КОГДА УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.УСОERP_ГарантийноеУдержание)
		|				ИЛИ УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.УСОERP_ГарантийноеУдержание)
		|			ТОГДА УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.СтатьяБДДСГарантийногоУдержания
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиБюджетов.ПустаяСсылка)
		|	КОНЕЦ КАК СтатьяБюджетов
		|ПОМЕСТИТЬ ПредварительныеДанные
		|ИЗ
		|	РегистрНакопления.УСОERP_ГрафикДвиженийПоДоговору.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , ) КАК УСОERP_ГрафикДвиженийПоДоговоруОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_СоответствиеОбъектовСтроительстваПроектам КАК УСОERP_СоответствиеОбъектовСтроительстваПроектам
		|		ПО УСОERP_ГрафикДвиженийПоДоговоруОбороты.ОбъектСтроительства = УСОERP_СоответствиеОбъектовСтроительстваПроектам.ОбъектСтроительства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_ДополнительныеПараметрыПоДоговору.СрезПоследних(&КонецПериода, ) КАК УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних
		|		ПО УСОERP_ГрафикДвиженийПоДоговоруОбороты.Договор = УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Договор
		|			И УСОERP_ГрафикДвиженийПоДоговоруОбороты.Контрагент = УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Контрагент
		|			И УСОERP_ГрафикДвиженийПоДоговоруОбороты.ОбъектСтроительства = УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.ОбъектСтроительства
		|ГДЕ
		|	УСОERP_СоответствиеОбъектовСтроительстваПроектам.Проект = &Проект
		|	И УСОERP_ГрафикДвиженийПоДоговоруОбороты.Организация = &Организация
		|	И УСОERP_ГрафикДвиженийПоДоговоруОбороты.ФинансированиеПланПриход <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Контрагент,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Договор,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.ВидРабот,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Работа,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Период,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты,
		|	ВЫБОР
		|		КОГДА УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.АвансДоОбеспечения)
		|				ИЛИ УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки)
		|				ИЛИ УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.АвансДоПодтверждения)
		|				ИЛИ УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.ПредоплатаДоПоступления)
		|			ТОГДА УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.СтатьяБДДСАвансовогоПлатежа
		|		КОГДА УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
		|				ИЛИ УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.КредитПослеПоступления)
		|			ТОГДА УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.СтатьяБДДСОсновногоПлатежа
		|		КОГДА УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.УСОERP_ГарантийноеУдержание)
		|				ИЛИ УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.УСОERP_ГарантийноеУдержание)
		|			ТОГДА УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.СтатьяБДДСГарантийногоУдержания
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиБюджетов.ПустаяСсылка)
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПредварительныеДанные.Контрагент КАК Контрагент,
		|	ПредварительныеДанные.Договор КАК Договор,
		|	ПредварительныеДанные.ВидРабот КАК ВидРабот,
		|	ПредварительныеДанные.Работа,
		|	ПредварительныеДанные.Сумма,
		|	ПредварительныеДанные.ПорядокОплаты,
		|	ПредварительныеДанные.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ПредварительныеДанные.СтатьяБюджетов.ПометкаУдаления
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиБюджетов.ПустаяСсылка)
		|		ИНАЧЕ ПредварительныеДанные.СтатьяБюджетов
		|	КОНЕЦ КАК СтатьяБюджетов
		|ИЗ
		|	ПредварительныеДанные КАК ПредварительныеДанные
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	Контрагент,
		|	Договор,
		|	ВидРабот";
		
	Запрос.УстановитьПараметр("Проект",Объект.Проект);	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);	
	Запрос.УстановитьПараметр("НачалоПериода",Объект.НачалоПериода);	
	Запрос.УстановитьПараметр("КонецПериода",Объект.ОкончаниеПериода);	
	
	ДанныеПлатежейИПоступлений = Запрос.Выполнить().Выгрузить();
	
	Объект.ИсходныеДанные.Загрузить(ДанныеПлатежейИПоступлений);
	
КонецПроцедуры // ПолучитьДанныеплатежейИПоступлений()

&НаСервере
Процедура ПолучитьДанныеДоходовРасходов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Контрагент КАК Контрагент,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Договор КАК Договор,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.ВидРабот КАК ВидРабот,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Работа,
		|	СУММА(УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокДоходовРасходовПланПриход) КАК Сумма,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокДоходовРасходов,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Период КАК Период,
		|	УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.СтатьяБюджетаБДР КАК СтатьяБюджетов
		|ПОМЕСТИТЬ ПредварительныеДанные
		|ИЗ
		|	РегистрНакопления.УСОERP_ГрафикДвиженийПоДоговору.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , ) КАК УСОERP_ГрафикДвиженийПоДоговоруОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_СоответствиеОбъектовСтроительстваПроектам КАК УСОERP_СоответствиеОбъектовСтроительстваПроектам
		|		ПО УСОERP_ГрафикДвиженийПоДоговоруОбороты.ОбъектСтроительства = УСОERP_СоответствиеОбъектовСтроительстваПроектам.ОбъектСтроительства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_ДополнительныеПараметрыПоДоговору.СрезПоследних(&КонецПериода, ) КАК УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних
		|		ПО УСОERP_ГрафикДвиженийПоДоговоруОбороты.Договор = УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Договор
		|			И УСОERP_ГрафикДвиженийПоДоговоруОбороты.Контрагент = УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Контрагент
		|			И УСОERP_ГрафикДвиженийПоДоговоруОбороты.ОбъектСтроительства = УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.ОбъектСтроительства
		|ГДЕ
		|	УСОERP_СоответствиеОбъектовСтроительстваПроектам.Проект = &Проект
		|	И УСОERP_ГрафикДвиженийПоДоговоруОбороты.Организация = &Организация
		|	И УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокДоходовРасходовПланПриход <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Контрагент,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Договор,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.ВидРабот,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Работа,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.Период,
		|	УСОERP_ГрафикДвиженийПоДоговоруОбороты.ПорядокДоходовРасходов,
		|	УСОERP_ДополнительныеПараметрыПоДоговоруСрезПоследних.Регистратор.СтатьяБюджетаБДР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПредварительныеДанные.Контрагент КАК Контрагент,
		|	ПредварительныеДанные.Договор КАК Договор,
		|	ПредварительныеДанные.ВидРабот КАК ВидРабот,
		|	ПредварительныеДанные.Работа,
		|	ПредварительныеДанные.Сумма,
		|	ПредварительныеДанные.ПорядокДоходовРасходов,
		|	ПредварительныеДанные.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ПредварительныеДанные.СтатьяБюджетов.ПометкаУдаления
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиБюджетов.ПустаяСсылка)
		|		ИНАЧЕ ПредварительныеДанные.СтатьяБюджетов
		|	КОНЕЦ КАК СтатьяБюджетов
		|ИЗ
		|	ПредварительныеДанные КАК ПредварительныеДанные
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	Контрагент,
		|	Договор,
		|	ВидРабот";
		
	Запрос.УстановитьПараметр("Проект",Объект.Проект);	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);	
	Запрос.УстановитьПараметр("НачалоПериода",Объект.НачалоПериода);	
	Запрос.УстановитьПараметр("КонецПериода",Объект.ОкончаниеПериода);	
	
	ДанныеПлатежейИПоступлений = Запрос.Выполнить().Выгрузить();
	
	Объект.ИсходныеДанные.Загрузить(ДанныеПлатежейИПоступлений);
	
КонецПроцедуры // ПолучитьДанныеплатежейИПоступлений()

#КонецОбласти

#Область ФормированиеЭкземпляраБюджета

&НаКлиенте
Процедура СформироватьЭкземплярБюджета(Команда)
		
	Если Не ПроверитьЗаполнение() тогда	
		Возврат;
	КонецЕсли;	
	
	Если Объект.НачалоПериода>Объект.ОкончаниеПериода тогда 
		сообщить("Неправильно задан период: начало периода должно быть меньше или равно окончанию");
	КонецЕсли;	
	
	Если Объект.ИсходныеДанные.Количество() = 0 тогда
		Сообщить("Не заполнена таблица данных для формирования экземпляра бюджета");
		Возврат;
	Иначе
		Для каждого строка из объект.ИсходныеДанные цикл
			Если НЕ ЗначениеЗаполнено(Строка.СтатьяБюджетов) тогда
				Сообщить("В строке №"+Строка.НомерСтроки+" не указана статья бюджета");
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
	
	ФормаНовогоДокумента = ПолучитьФорму("Документ.ЭкземплярБюджета.Форма.ФормаДокумента"); 
	ДанныеФормы = ФормаНовогоДокумента.Объект; 
	
	ЗаполнитьШапкуДокументаЭкземплярБюджетаСервер(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, ФормаНовогоДокумента.Объект);
	
	ФормаНовогоДокумента.ПриИзмененииВидаБюджетаСервер();
	ФормаНовогоДокумента.ПриИзмененииСценарияСервер();
	ФормаНовогоДокумента.ПриИзмененииПериодаСервер();
	ФормаНовогоДокумента.ОрганизацияПриИзмененииНаСервере();
	ФормаНовогоДокумента.СформироватьОтчетСервер(Истина);

	ЗаполнитьТабличнуюЧастьЭкземплярБюджетаСервер(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, ФормаНовогоДокумента.Объект);
	
	ФормаНовогоДокумента.СформироватьОтчетСервер(Истина,Истина);
	ФормаНовогоДокумента.Открыть();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШапкуДокументаЭкземплярБюджетаСервер(ДанныеФормы)
	
	ДокЭкзеплярБюджета = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ЭкземплярБюджета")); 
	
	ДокЭкзеплярБюджета.Статус 					= Перечисления.СтатусыПланов.ВПодготовке;
	ДокЭкзеплярБюджета.МодельБюджетирования		= Объект.ВидБюджета.Владелец;
	ДокЭкзеплярБюджета.Дата 					= ТекущаяДата();
	ДокЭкзеплярБюджета.Ответственный			= ПараметрыСеанса.ТекущийПользователь;
	ДокЭкзеплярБюджета.Организация 				= Объект.Организация;
	ДокЭкзеплярБюджета.Сценарий 				= Объект.Сценарий;	
	ДокЭкзеплярБюджета.ВидБюджета 				= Объект.ВидБюджета;
	ДокЭкзеплярБюджета.НачалоПериода			= Объект.НачалоПериода;
	ДокЭкзеплярБюджета.ОкончаниеПериода			= Объект.ОкончаниеПериода;
	ДокЭкзеплярБюджета.Организация 				= Объект.Организация;
	
	ЗначениеВДанныеФормы(ДокЭкзеплярБюджета, ДанныеФормы);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАналитикуШапки(ВидАналитики,СтрокаИсточник)
	
	Если НЕ ЗначениеЗаполнено(ВидАналитики) тогда
		Возврат ПланыВидовХарактеристик.АналитикиСтатейБюджетов.ПустаяСсылка();	
	ИначеЕсли ВидАналитики = ПланыВидовХарактеристик.АналитикиСтатейБюджетов.Проекты тогда
		Возврат СтрокаИсточник.Проект;
	Иначе
		Возврат Новый(ВидАналитики.ТипЗначения.Типы()[0]);
	КонецЕсли;
		
КонецФункции

&НаСервере
Функция ПолучитьАналитикуТабличнойЧасти(ВидАналитики,СтрокаИсточник)
	
	Если НЕ ЗначениеЗаполнено(ВидАналитики) тогда
		Возврат ПланыВидовХарактеристик.АналитикиСтатейБюджетов.ПустаяСсылка();	
	ИначеЕсли ВидАналитики.ТипЗначения.СодержитТип(Тип("СправочникСсылка.УСОERP_СтроительныеРаботы")) тогда
		Если НЕ ЗначениеЗаполнено(СтрокаИсточник.Работа) И ВидАналитики.ТипЗначения.СодержитТип(Тип("СправочникСсылка.УСОERP_ВидыРабот")) Тогда
			Возврат СтрокаИсточник.ВидРабот;
		Иначе	 
			Возврат СтрокаИсточник.Работа;
		КонецЕсли;
	ИначеЕсли ВидАналитики.ТипЗначения.СодержитТип(Тип("СправочникСсылка.УСОERP_ВидыРабот")) тогда		
		Возврат СтрокаИсточник.ВидРабот;
	ИначеЕсли ВидАналитики = ПланыВидовХарактеристик.АналитикиСтатейБюджетов.Контрагенты тогда
		Возврат СтрокаИсточник.Контрагент;
	ИначеЕсли ВидАналитики = ПланыВидовХарактеристик.АналитикиСтатейБюджетов.Договоры тогда
		Возврат СтрокаИсточник.Договор;	
	Иначе
		Возврат Новый(ВидАналитики.ТипЗначения.Типы()[0]);
	КонецЕсли;
		
КонецФункции

&НаСервере
Процедура ДополнитьСтруктуруПоискаСтатьи(Аналитика,ВидАналитики,СтруктураПоиска,СворачиваемыеАналитики)
		
	Если НЕ ЗначениеЗаполнено(ВидАналитики) тогда
		//Возврат ПланыВидовХарактеристик.АналитикиСтатейБюджетов.ПустаяСсылка();	
	ИначеЕсли ВидАналитики.ТипЗначения.СодержитТип(Тип("СправочникСсылка.УСОERP_ВидыРабот")) тогда
		Если ТипЗнч(Аналитика) = Тип("СправочникСсылка.УСОERP_ВидыРабот") Тогда
			СтруктураПоиска.Вставить("ВидРабот",Аналитика);
			СворачиваемыеАналитики = СворачиваемыеАналитики+",ВидРабот";
		ИначеЕсли ВидАналитики.ТипЗначения.СодержитТип(Тип("СправочникСсылка.УСОERP_СтроительныеРаботы")) 
			И ТипЗнч(Аналитика) = Тип("СправочникСсылка.УСОERP_СтроительныеРаботы") Тогда
			СтруктураПоиска.Вставить("Работа",Аналитика);
			СворачиваемыеАналитики = СворачиваемыеАналитики+",Работа";
		КонецЕсли;
	ИначеЕсли ВидАналитики.ТипЗначения.СодержитТип(Тип("СправочникСсылка.УСОERP_СтроительныеРаботы")) тогда
		СтруктураПоиска.Вставить("Работа",Аналитика);
		СворачиваемыеАналитики = СворачиваемыеАналитики+",Работа";	
	ИначеЕсли ВидАналитики = ПланыВидовХарактеристик.АналитикиСтатейБюджетов.Контрагенты тогда
		СтруктураПоиска.Вставить("Контрагент",Аналитика);	
		СворачиваемыеАналитики = СворачиваемыеАналитики+",Контрагент";		
	ИначеЕсли ВидАналитики = ПланыВидовХарактеристик.АналитикиСтатейБюджетов.Договоры тогда
		СтруктураПоиска.Вставить("Договор",Аналитика);
		СворачиваемыеАналитики = СворачиваемыеАналитики+",Договор";		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьИсходныеДанныеПоПериодуВидаБюджета()
	
	ТаблицаСтатей = Объект.ИсходныеДанные.Выгрузить();
	
	Для каждого Строка из ТаблицаСтатей цикл
		Если НЕ ЗначениеЗаполнено(Строка.СтатьяБюджетов) тогда
			ТаблицаСтатей.Удалить(строка);
		КонецЕсли;
		
		//Строка.Период = БюджетированиеКлиентСервер.ДатаНачалаПериода(Строка.Период, Объект.ВидБюджета.Периодичность);
        Строка.Период = БюджетированиеКлиентСервер.ДатаНачалаПериода(Строка.Период, Перечисления.Периодичность.Месяц);
		
	КонецЦикла;	

	Возврат ТаблицаСтатей;
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьЭкземплярБюджетаСервер(ДанныеФормы)
		
	ДокЭкзеплярБюджета = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ЭкземплярБюджета")); 

	//Заполним аналитики шаки
	Для каждого строка из Объект.ВидБюджета.АналитикиШапки цикл
		ДокЭкзеплярБюджета["Аналитика"+строка.НомерСтроки] = ПолучитьАналитикуШапки(строка.ВидАналитики,Объект)
	КонецЦикла;
	
	ТаблицаИсходныеДанные = ПолучитьИсходныеДанныеПоПериодуВидаБюджета();
	
	//Заполним табличные части
	ТаблицаСтатей = ТаблицаИсходныеДанные.Скопировать( ,"СтатьяБюджетов,Контрагент,Договор,ВидРабот,Работа");
	ТаблицаСтатей.Свернуть("СтатьяБюджетов,Контрагент,Договор,ВидРабот,Работа");
	
	Для каждого строка из ТаблицаСтатей цикл
		
		НоваяСтатьяБюджетов = ДокЭкзеплярБюджета.АналитикаСтатейБюджетов.Добавить();	
		НоваяСтатьяБюджетов.СтатьяБюджетов = строка.СтатьяБюджетов;
		НоваяСтатьяБюджетов.Валюта = Объект.Сценарий.Валюта;
		
		НоваяСтатьяБюджетов.Аналитика1 = ПолучитьАналитикуТабличнойЧасти(Строка.СтатьяБюджетов.ВидАналитики1,Строка);
		НоваяСтатьяБюджетов.Аналитика2 = ПолучитьАналитикуТабличнойЧасти(Строка.СтатьяБюджетов.ВидАналитики2,Строка);
		НоваяСтатьяБюджетов.Аналитика3 = ПолучитьАналитикуТабличнойЧасти(Строка.СтатьяБюджетов.ВидАналитики3,Строка);
		НоваяСтатьяБюджетов.Аналитика4 = ПолучитьАналитикуТабличнойЧасти(Строка.СтатьяБюджетов.ВидАналитики4,Строка);
		НоваяСтатьяБюджетов.Аналитика5 = ПолучитьАналитикуТабличнойЧасти(Строка.СтатьяБюджетов.ВидАналитики5,Строка);
		НоваяСтатьяБюджетов.Аналитика6 = ПолучитьАналитикуТабличнойЧасти(Строка.СтатьяБюджетов.ВидАналитики6,Строка);
		
	КонецЦикла;
	
	ДокЭкзеплярБюджета.АналитикаСтатейБюджетов.Свернуть("СтатьяБюджетов,Валюта,Аналитика1,Аналитика2,Аналитика3,Аналитика4,Аналитика5,Аналитика6");
	
	Для каждого СтрокаСтатьиБюджета из ДокЭкзеплярБюджета.АналитикаСтатейБюджетов цикл
		
		//Установим Идентификатор строки
		ИДСтроки = Новый УникальныйИдентификатор;
		СтрокаСтатьиБюджета.ИдентификаторСтроки = ИДСтроки;		
		
		ТаблицаОборотыПоСтатьямБюджетов = ТаблицаИсходныеДанные.Скопировать( ,"Период,СтатьяБюджетов,Контрагент,Договор,ВидРабот,Работа,Сумма");

		СворачиваемыеАналитики = "Период,СтатьяБюджетов"; 
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("СтатьяБюджетов",СтрокаСтатьиБюджета.СтатьяБюджетов);
		
		ДополнитьСтруктуруПоискаСтатьи(СтрокаСтатьиБюджета.Аналитика1,СтрокаСтатьиБюджета.СтатьяБюджетов.ВидАналитики1,СтруктураПоиска,СворачиваемыеАналитики);
		ДополнитьСтруктуруПоискаСтатьи(СтрокаСтатьиБюджета.Аналитика2,СтрокаСтатьиБюджета.СтатьяБюджетов.ВидАналитики2,СтруктураПоиска,СворачиваемыеАналитики);
		ДополнитьСтруктуруПоискаСтатьи(СтрокаСтатьиБюджета.Аналитика3,СтрокаСтатьиБюджета.СтатьяБюджетов.ВидАналитики3,СтруктураПоиска,СворачиваемыеАналитики);
		ДополнитьСтруктуруПоискаСтатьи(СтрокаСтатьиБюджета.Аналитика4,СтрокаСтатьиБюджета.СтатьяБюджетов.ВидАналитики4,СтруктураПоиска,СворачиваемыеАналитики);
		ДополнитьСтруктуруПоискаСтатьи(СтрокаСтатьиБюджета.Аналитика5,СтрокаСтатьиБюджета.СтатьяБюджетов.ВидАналитики5,СтруктураПоиска,СворачиваемыеАналитики);
		ДополнитьСтруктуруПоискаСтатьи(СтрокаСтатьиБюджета.Аналитика6,СтрокаСтатьиБюджета.СтатьяБюджетов.ВидАналитики6,СтруктураПоиска,СворачиваемыеАналитики);
		
		ТаблицаОборотыПоСтатьямБюджетов.Свернуть(СворачиваемыеАналитики,"Сумма");
		СтрокиПоСтатьеБюджета = ТаблицаОборотыПоСтатьямБюджетов.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого СтрокаСтатейБюджетов из СтрокиПоСтатьеБюджета Цикл 
			НовыйОборотПоСтатьямБюджетов = ДокЭкзеплярБюджета.ОборотыПоСтатьямБюджетов.Добавить();
			НовыйОборотПоСтатьямБюджетов.ИдентификаторСтроки 	= ИДСтроки;			
			НовыйОборотПоСтатьямБюджетов.ПериодПланирования 	= СтрокаСтатейБюджетов.Период;
			НовыйОборотПоСтатьямБюджетов.Сумма 					= СтрокаСтатейБюджетов.Сумма;
			НовыйОборотПоСтатьямБюджетов.Количество				= 0;
			НовыйОборотПоСтатьямБюджетов.СуммаВВалюте 			= СтрокаСтатейБюджетов.Сумма;
			НовыйОборотПоСтатьямБюджетов.НомерПоПорядку			= НовыйОборотПоСтатьямБюджетов.НомерСтроки;
		КонецЦикла;	
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ДокЭкзеплярБюджета, ДанныеФормы);
	
КонецПроцедуры

#КонецОбласти
